'''
Проанализировать скорость и сложность одного любого алгоритма из разработанных в рамках
домашнего задания первых трех уроков.

Примечание. Идеальным решением будет:

a. выбрать хорошую задачу, которую имеет смысл оценивать,

b. написать 3 варианта кода (один у вас уже есть),

c. проанализировать 3 варианта и выбрать оптимальный,

d. результаты анализа вставить в виде комментариев в файл с кодом (не забудьте указать,
для каких N вы проводили замеры),

e. написать общий вывод: какой из трёх вариантов лучше и почему.

Прозведена эмпирическая оценка!
из трех вариантов - l3_7_ver1, l3_7_ver2, l3_7_ver3: первый вариант меньше обрашает
к функциям, но долбше работает. Второй вариант больше обрашает к функциям, но быстрее работает.
Показаний третьего варианта примерно средний.

Лучший вариант: второй!

'''